<head>
  <meta name="author" content="Rogério de Oliveira">
  <meta institution="author" content="Universidade Presbiteriana Mackenzie">
</head>

<img src="http://meusite.mackenzie.br/rogerio/mackenzie_logo/UPM.2_horizontal_vermelho.jpg" width=300, align="right"> 

<h1 align=left><font size = 8, style="color:rgb(200,0,0)"><b>Ciência de Dados </b></font></h1> 
<h1 align=left><font size = 5, style="color:rgb(0,0,0)"><b>Paradigmas de Linguagens de
Programação para Ciência de Dados</b></font></h1> 

# 2 Seleção e Organização de Dados com Pandas
Professores: *Diego Nogare* & *Rogério de Oliveira* 

<br>
<br>

---

# Exercícios

Nos exercícios a seguir emprege a base de dados `titanic`.

Todos exercícios possuem várias soluções possíveis, mas não se preocupe com isso. A melhor solução é primeiro, a que funciona para você!

In [12]:
import numpy as np
import pandas as pd
import seaborn as sns
from random import choices

titanic = sns.load_dataset('titanic')
titanic.head()

   survived  pclass     sex   age  ...  deck  embark_town  alive  alone
0         0       3    male  22.0  ...   NaN  Southampton     no  False
1         1       1  female  38.0  ...     C    Cherbourg    yes  False
2         1       3  female  26.0  ...   NaN  Southampton    yes   True
3         1       1  female  35.0  ...     C  Southampton    yes  False
4         0       3    male  35.0  ...   NaN  Southampton     no   True

[5 rows x 15 columns]

1. Qual a quantidade de linhas e colunas de `titanic`?

In [13]:
titanic.shape

(891, 15)

2. Qual a idade do passageiro mais velho?

In [14]:
titanic.age.max()

80.0

3. Qual a idade da sobrevivente feminina mais velha?

In [23]:
titanic[ (titanic.alive == 'yes') & (titanic.sex == 'female') ].age.max()

63.0

4. Qual o percentual de sobreviventes da primeira e terceira classes?

In [24]:
print('Third Class Survived :' , 
      titanic[ (titanic.alive == 'yes') & (titanic['class'] == 'Third') ].alive.count() / titanic[ (titanic['class'] == 'Third') ].alive.count() )
print('First Class Survived :' , 
      titanic[ (titanic.alive == 'yes') & (titanic['class'] == 'First') ].alive.count() / titanic[ (titanic['class'] == 'First') ].alive.count() )

Third Class Survived : 0.24236252545824846
First Class Survived : 0.6296296296296297

5. Analise a média de idade dos passageiros por classe e sexo (sugestão: empregue groupby). Você pode notar que?

In [26]:
titanic.groupby(['class','sex']).age.mean()

class   sex
First   female    34.611765
        male      41.281386
Second  female    28.722973
        male      30.740707
Third   female    21.750000
        male      26.507589
Name: age, dtype: float64